## Open a terminal window and run the following commands:
sudo bash
start-hadoop
cd /home/student/ROI/SparkProgram/Day3
./fixhive.sh

## Let's make a simple hive table for regions.

In [ ]:
! cat /class/regions.hql
! /class/fixhive.sh

In [22]:
import sys
print(sys.version)

3.7.5 (default, Dec  9 2021, 17:04:37)
[GCC 8.4.0]

In [1]:
import sys
sys.path.append('/class')
from initspark import *
sc, spark, conf = initspark()

initializing pyspark
packages None
No pacakges chosen pyspark-shell

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

pyspark initialized

In [6]:
# regions = spark.read.table('default.regions')
# regions.show()
# regions = spark.sql('select * from default.regions')
# regions.show()
regions3 = spark.read.csv('file:///class/datasets/northwind/CSVHeaders/regions', sep =',', header=True, inferSchema=True)
display(regions3)
print(regions3)
#regions3.show()
# regions.write.json('file:///tmp/regions.json')

   RegionID RegionName
0         1    Eastern
1         2    Western
2         3   Northern
3         4   Southern

DataFrame[RegionID: int, RegionName: string]

# ! pip install sparksql-magic

In [7]:
%load_ext sparksql_magic

In [8]:
regions3.createOrReplaceTempView('regions')
regions = spark.sql('select * from regions where regionid < 4')
display(regions)

   RegionID RegionName
0         1    Eastern
1         2    Western
2         3   Northern

In [9]:
%%sparksql
select * from regions

In [15]:
display(df)

NameError: name 'df' is not defined

In [ ]:
%%sparksql --cache --view result df
select * from regions

## You can query an existing Hive table and bring it into a Spark DataFrame.

In [ ]:
df.show()

In [ ]:
regions = spark.sql('select * from regions')
regions.show()
print(regions)

## Read in a file to a Spark DataFrame.

In [13]:
territories = spark.read.csv('file:///class/datasets/northwind/CSVHeaders/territories',
                             inferSchema=True, header=True)
#t = territories.filter("regionid = 2").sort('TerritoryName')
orderByVar = 'RegionID'
t = territories \
    .orderBy(orderByVar) \
    .where("regionid = 2") \
    .select('RegionID','TerritoryID', 'TerritoryName')
display(t)
#territories.show()
#help(t.sample)
# print(territories.count())
# display(territories.sample(withReplacement=False, fraction=.5))
#display(spark.sql('select * from territories where regionid = 2'))
# spark.read.table('territories').where('regionid=2')
#dir(territories)

   RegionID  TerritoryID     TerritoryName
0         2        60179   Hoffman Estates
1         2        60601           Chicago
2         2        80202            Denver
3         2        80909  Colorado Springs
4         2        85014           Phoenix
5         2        85251        Scottsdale
6         2        90405      Santa Monica
7         2        94025        Menlo Park
8         2        94105     San Francisco
9         2        95008          Campbell

## Use createOrReplaceTempView to create a virtual table in the Hive catalog and then it can be queried using SQL as if it were a hive table.

In [14]:
territories.createOrReplaceTempView('territories')
t1 =spark.sql('select * from territories where regionid = 1')
t1.show()
print(t1.count())

+-----------+-------------+--------+
|TerritoryID|TerritoryName|RegionID|
+-----------+-------------+--------+
|       1581|     Westboro|       1|
|       1730|      Bedford|       1|
|       1833|    Georgetow|       1|
|       2116|       Boston|       1|
|       2139|    Cambridge|       1|
|       2184|    Braintree|       1|
|       2903|   Providence|       1|
|       6897|       Wilton|       1|
|       7960|   Morristown|       1|
|       8837|       Edison|       1|
|      10019|     New York|       1|
|      10038|     New York|       1|
|      11747|     Mellvile|       1|
|      14450|     Fairport|       1|
|      19713|       Neward|       1|
|      20852|    Rockville|       1|
|      27403|   Greensboro|       1|
|      27511|         Cary|       1|
|      40222|   Louisville|       1|
+-----------+-------------+--------+

19

In [ ]:
%%sparksql
select regionid, count(*) from territories group by regionid order by 2 desc

In [ ]:
display(spark.sql('select regionid, count(*) from territories group by regionid order by 2 desc'))

In [17]:
spark.read.json('file:///class/datasets/northwind/JSON/territories').createOrReplaceTempView('territoriesj')
sql = """
select regionid, count(*) as cnt
from territoriesj 
group by regionid
"""
orderby = 'regionid'

x = spark.sql(sql).orderBy(orderby)
display(x)

   regionid  cnt
0         1   19
1         2   15
2         3   11
3         4    8

In [ ]:
spark.read.json('file:///class/datasets/northwind/JSON/territories').createOrReplaceTempView('territoriesj')
sql = """
select regionid, count(*) as cnt
from territoriesj 
group by regionid
order by regionid
"""

x = spark.sql(sql)
display(x)


## Spark DataFrames can be saved to a Hive table using either the saveAsTable method or writing a SQL query that uses CREATE TABLE AS.

In [18]:
territories.write.saveAsTable('territories3', mode='overwrite', path = 'hdfs://localhost:9000/territories3',
                             format='json')
#spark.sql('create table Territories3 as select * from territories')
#help(territories.write.saveAsTable)

## Confirm that the tables exist in Hive.
From the command line type hive or spark-sql and then show tables;

In [ ]:
#! hive -e "show tables;"
! spark-sql "show tables;"

## Queries use standard HQL to mix Hive tables and virtual tables. Both are read into a Spark DataFrame and the processing happens at the Spark level, not at the Hive level. HQL is just used to parse the logic into the corresponding Spark methods.

In [ ]:
sql = """
select r.regionid, r.regionname, t.territoryid, t.territoryname 
from regions as r 
join territories as t on r.regionid = t.regionid 
order by r.regionid, t.territoryid
"""
rt = spark.sql(sql)
rt.show(10)

tr = regions.join(territories, regions.regionid == territories.RegionID). \
     select('regions.regionid', 'regionname', 'TerritoryID', 'TerritoryName') .\
    orderBy('regionid', 'territoryid')
tr.show(10)

## LAB: ## 
### Read the northwind JSON products and make it into a TempView and do the same with the CSVHeaders version of categories.
<br>
<details><summary>Click for <b>hint</b></summary>
<p>
Look at Day 2 or below to copy the code to load in the DataFrames
<br>
Turn each DataFrame into a temporary view
<br>
<br>
</p>
</details>

<details><summary>Click for <b>code</b></summary>
<p>

```python
categories = spark.read.load('/class/datasets/northwind/CSV/categories', format = 'csv', sep = ',', inferSchema = True, header = False)

prodSchema = StructType([
    StructField('productid', IntegerType()), 
    StructField('productname', StringType()),
    StructField('supplierid', IntegerType()), 
    StructField('categoryid', IntegerType()), 
    StructField('quantityperunit', StringType()), 
    StructField('unitprice', FloatType()), 
    StructField('unitsinstock', IntegerType()), 
    StructField('unitsonorder', IntegerType()), 
    StructField('reorderlevel', IntegerType()), 
    StructField('discontinued', IntegerType())
])
products = spark.read.json('/class/datasets/northwind/JSON/products', schema=prodSchema)

categories.createOrReplaceTempView('categories')
products.createOrReplaceTempView('products')```
</p>
</details>

In [21]:
spark.read.json('file:///class/datasets/northwind/JSON/products').createOrReplaceTempView('products')
sql = """
select * from products
"""
p = spark.sql(sql)
display(p)

spark.read.csv('file:///class/datasets/northwind/CSVHeaders/categories', sep =',', header=True, inferSchema=True).createOrReplaceTempView('categories')
c = spark.sql('select * from categories')
display(c)

,categoryid,discontinued,productid,productname,quantityperunit,reorderlevel,supplierid,unitprice,unitsinstock,unitsonorder
0,1,1,1,Chai,10 boxes x 30 bags,10,8,18.00,39,0
1,1,1,2,Chang,24 - 12 oz bottles,25,1,19.00,17,40
2,2,0,3,Aniseed Syrup,12 - 550 ml bottles,25,1,10.00,13,70
3,2,0,4,Chef Anton's Cajun Seasoning,48 - 6 oz jars,0,2,22.00,53,0
4,2,1,5,Chef Anton's Gumbo Mix,36 boxes,0,2,21.35,0,0
5,2,0,6,Grandma's Boysenberry Spread,12 - 8 oz jars,25,3,25.00,120,0
6,7,0,7,Uncle Bob's Organic Dried Pears,12 - 1 lb pkgs.,10,3,30.00,15,0
7,2,0,8,Northwoods Cranberry Sauce,12 - 12 oz jars,0,3,40.00,6,0
8,6,1,9,Mishi Kobe Niku,18 - 500 g pkgs.,0,4,97.00,29,0
9,8,0,10,Ikura,12 - 200 ml jars,0,4,31.00,31,0

,CategoryID,CategoryName,Description
0,1,Beverages,Soft drinks coffees teas beers and ales
1,2,Condiments,Sweet and savory sauces relishes spreads and s...
2,3,Confections,Desserts candies and sweet breads
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,Breads crackers pasta and cereal
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish

## Install the MySQL Python connector. This has nothing to do with Spark, but if you want to run SQL queries directly it is helpful.
It's already on our machines so we don't need to run this now.

In [ ]:
! pip install mysql-connector-python

## Let's make sure we have a database for northwind and no regions table.

In [ ]:
import mysql.connector
try:
    cn = mysql.connector.connect(host='localhost', user='test', password='password')
    cursor = cn.cursor()
    cursor.execute('create database if not exists northwind')
    cn.close()

    cn = mysql.connector.connect(host='localhost', user='test', password='password', database='northwind')
    cursor = cn.cursor()    
    cursor.execute('drop table if exists regions')
    cn.close()
except:
    print('something went wrong')
else:
    print('success')

## Write a DataFrame to a SQL database.

In [ ]:
display(regions)

In [ ]:
help(regions.write.jdbc)

In [ ]:
regions.write.format("jdbc").options(url="jdbc:mysql://localhost/northwind", \
                                     driver='com.mysql.jdbc.Driver', \
                                     dbtable='regions', \
                                     user='test', password = "password", mode = "overwrite", \
                                     useSSL = "false").save()

## Read a SQL table into a Spark DataFrame.

In [24]:
regions2 = spark.read.format("jdbc").options(url="jdbc:mysql://localhost/northwind", \
                                             driver="com.mysql.jdbc.Driver", \
                                             dbtable= "regions", \
                                             user="test", password="password").load()
regions2.show()

#spark.read.table('regions').show()
spark.sql('select * from regions').show()

+--------+----------+
|regionid|regionname|
+--------+----------+
|       1|   Eastern|
|       2|   Western|
|       3|  Northern|
|       4|  Southern|
|       5|    Africa|
+--------+----------+

+--------+----------+
|RegionID|RegionName|
+--------+----------+
|       1|   Eastern|
|       2|   Western|
|       3|  Northern|
|       4|  Southern|
+--------+----------+

## If you don't wont to bring an entire SQL table into a spark DataFrame use query instead of dbtable.

In [ ]:
regions3 = spark.read.format("jdbc").options(url="jdbc:mysql://localhost/northwind", \
                                             driver="com.mysql.jdbc.Driver", \
                                             query= "select * from regions where regionid < 3", \
                                             user="test", password="password").load()
regions3.show()

## Creating the regions2 DataFrame does not execute anything yet, but by making the DataFrame into a Temp View then running a Spark SQL query, it tells Spark to read the SQL data into a DataFrame and then use the cluster to do the processing, not the SQL source.

In [ ]:
regions2.createOrReplaceTempView('regions2')
spark.sql('select * from regions2 where regionid < 3').show()

In [ ]:
spark.read.table('regions2').where('regionid < 3').show()

## Alternate ways to code a query using SQL and methods.

In [ ]:
print(spark.sql('select count(*) from regions').collect())
spark.sql('select * from regions').count()

## Using SQL you can use familiar syntax instead of withColumn or withColumnRenamed methods.
Note the expr function needs to be imported when you want to use a stringified SQL function using dot syntax.

In [ ]:
from pyspark.sql.functions import expr

t1 = spark.sql('select TerritoryID as TerrID, UPPER(TerritoryName) as TerritoryName, RegionID from territories')
t1.show(5)

from pyspark.sql.functions import expr
territories.withColumn('TerritoryName', expr('UPPER(TerritoryName)')).withColumnRenamed('TerritoryID', 'TerrID').show(5)

In [ ]:
from pyspark.sql.functions import udf
from pyspark.sql.types import *

# This won't work though if you want to use python functions, you need to go another step
# territories.withColumn('TerritoryName', territories.TerritoryName.upper()).show()

# You need to make the python function callable by spark by wrapping it in the udf function
# which tells spark what datatype it returns
territories.withColumn('TerritoryName', udf(str.upper, StringType())(territories.TerritoryName)).show()

## If you want to use a function that is not a standard Python or SQL function, you can always create one in Python and make it callable from Spark.

In [ ]:
from pyspark.sql.functions import udf
from pyspark.sql.types import *

def inventoryvalue(quantity, price):
    return quantity * price

# Turn the Python function into a Spark callable function
invvalue = udf(inventoryvalue, FloatType())
p = products
p2 = p.withColumn('value', invvalue(p.unitsinstock, p.unitprice))
display(p2)

## Python decorators are an even better option.

In [ ]:
@udf(FloatType())
def inventoryvalue(quantity, price):
    return quantity * price

p2 = p.withColumn('value', inventoryvalue(p.unitsinstock, p.unitprice))
display(p2)

In [ ]:
from pyspark.sql.functions import udf
from pyspark.sql.types import *

def inventoryvalue(quantity, price):
    return quantity * price

# Or dynamically wrap it, but it's harder to read
p2 = p.withColumn('value', udf(inventoryvalue, FloatType())(p.unitsinstock, p.unitprice))
display(p2)

## To make it easier though, you could make the Python function into a udf that SQL can understand similar to how you can make a DataFrame seem like a virtual table with createOrReplaceTempView.

In [ ]:
def reverseString(x):
    return x[::-1]

spark.udf.register('reverse', reverseString, StringType())

spark.sql('select *, reverse(TerritoryName) as Reversed from Territories').orderBy('Reversed').show()

## HQL has collect_set and collect_list functions to aggregate items into a list instead of summing them up.

In [ ]:
from pyspark.sql.functions import collect_list
territories.groupBy(territories.RegionID).agg(collect_list(territories.TerritoryName)).show()

tr1 = spark.sql("SELECT RegionID, collect_list(TerritoryName) AS TerritoryList FROM Territories GROUP BY RegionID")
tr1.show()
tr1.printSchema()
print(tr1.take(1))

## Instead of a simple datatype, you could also collect complex structured objects using the HQL NAMED_STRUCT.

In [ ]:
sql = """
SELECT r.RegionID, r.RegionName
, COLLECT_SET(NAMED_STRUCT("TerritoryID", TerritoryID, "TerritoryName", TerritoryName)) AS TerritoryList
FROM Regions AS r
JOIN Territories AS t ON r.RegionID = t.RegionID
GROUP BY r.RegionID, r.RegionName
ORDER BY r.RegionID
"""

tr2 = spark.sql(sql)
tr2.printSchema()
print(tr2)
tr2.show()
print(tr2.take(2))
tr2.write.json('TerritoryRegion.json')
spark.sql('create table TerritoryRegion as ' + sql)

## If you have data that is already collected into a complex datatype and want to flatten it, you could use HQL EXPLODE function.

## You could use the Spark explode method.

In [ ]:
from pyspark.sql.functions import explode
tr1.select('RegionID', explode('TerritoryList')).show()

## Or if the DataFrame is turned into a Temp View, you could use the HQL query to do it.

In [ ]:
tr1.createOrReplaceTempView('RegionTerritories')
sql = """
SELECT RegionID, TerritoryName
FROM RegionTerritories
LATERAL VIEW EXPLODE(TerritoryList) EXPLODED_TABLE AS TerritoryName
ORDER BY RegionID, TerritoryName
"""
spark.sql(sql).show()

## Or you could select specific elements from a collection.

In [ ]:
tr2.createOrReplaceTempView('RegionTerritories')
spark.sql("select RegionId, RegionName, TerritoryList[0] as First, TerritoryList[size(TerritoryList) - 1] as Last, size(TerritoryList) as TerritoryCount from RegionTerritories").show()

## If the array is of structs, note the syntax of fetching the elements from the struct uses the . like an object property.

In [ ]:
sql = """
SELECT RegionID, RegionName, Territory.TerritoryID AS TerritoryID
, Territory.TerritoryName AS TerritoryName
FROM RegionTerritories
LATERAL VIEW EXPLODE(TerritoryList) EXPLODED_TABLE AS Territory
"""
spark.sql(sql).show()

## HOMEWORK: ## 
**First Challenge**

Create a Python function to determine if a number is odd or even and use that to select only the even numbered shippers from the TSV folder of northwind. Note the TSV file does not have headers so you will need to do something to make the DataFrame have a meaningful structure. I would suggest using Spark SQL as much as possible to rename and cast the columns which are ShipperID, CompanyName, and Phone.

**Second Challenge**

Take the Order_LineItems.json folder, read it into a DataFrame, and flatten it and then calculate the average price paid for a product.

<br>
<details><summary>Click for <b>hint</b></summary>
<p>
Take a look at the MakeOrders_LineItems.py file provided to see how the Order_LineItems.json was generated in the first place
<br>
Use modulus with remainder of zero to determine if something is even
<br>
Use udf to make a version of the function that is callable using dot syntax and udf.register to make a version callable from within a SQL string
<br>
Use LATERAL VIEW EXPLODE() EXPLODED_TABLE to flatten out the nested format file
<br>
Once flattened do a traditional aggregate to calculate the average
<br>
<br>
</p>
</details>